{"$schema":"https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#","contentVersion":"1.0.0.0","parameters":{"workspace":{"type":"String"}},"resources":[{"id":"[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/AO-COL-MDFE-02:_ADWS_Connection_from_Process_Injection_Target')]","name":"[concat(parameters('workspace'),'/Microsoft.SecurityInsights/AO-COL-MDFE-02:_ADWS_Connection_from_Process_Injection_Target')]","type":"Microsoft.OperationalInsights/workspaces/providers/alertRules","kind":"Scheduled","apiVersion":"2023-12-01-preview","properties":{"displayName":"AO-COL-MDFE-02:_ADWS_Connection_from_Process_Injection_Target","description":"The query first collects all network connections to the Active Directory Web Services (ADWS) service.  It then searches for processes that inject into a process that makes a connection to ADWS.  ADWS is a Windows service that allows Active Directory to be queried via a web service.  While this service is not malicious by itself, it can be used by attackers to query Active Directory from compromised machines.  An attacker might inject code into a legitimate process and use that process to connect to ADWS.\n","severity":"Medium","enabled":true,"query":"let timeframe = 20m;\nlet ADWSConnections=materialize(\n    DeviceNetworkEvents\n    | where ingestion_time() \u003e= ago(timeframe)\n    | where ActionType == \"ConnectionSuccess\"\n    | where RemotePort == 9389\n    | where not(ipv4_is_in_range(RemoteIP, \"127.0.0.0/8\"))\n    | extend InitiatingProcessFileName=tolower(InitiatingProcessFileName)\n    // filtering processes that are expected to connect to ADWS\n    | where not(InitiatingProcessFolderPath startswith @\"c:\\windows\\system32\\windowspowershell\\\")\n    | where not(InitiatingProcessFolderPath startswith @\"c:\\windows\\syswow64\\windowspowershell\\\")\n    | where not(InitiatingProcessFolderPath startswith @\"c:\\program files\\powershell\\\" and InitiatingProcessFileName =~ \"pwsh.exe\")\n    | where not(InitiatingProcessFolderPath startswith @\"c:\\program files\\microsoft monitoring agent\\\")\n    | where not(InitiatingProcessFolderPath startswith @\"c:\\windows\\system32\\dsac.exe\")\n    | where not (InitiatingProcessFileName =~ \"rssrdp64.exe\" and InitiatingProcessFolderPath contains @\"\\appdata\\local\\securelink\\slinksw\")\n);\nlet ADWSFileNames=materialize(\n    ADWSConnections\n    | distinct InitiatingProcessFileName\n);\n// Look for processes that inject into a process that makes an ADWS connection.\nlet InjectorProcesses=materialize(\n    DeviceEvents\n    | where ingestion_time() \u003e= ago(timeframe)\n    | where not(isempty(FileName))\n    // Look for actions associated with process injection.\n    | where ActionType in~ (\"CreateRemoteThreadApiCall\", \"MemoryRemoteProtect\",\"NtAllocateVirtualMemoryApiCall\", \"NtAllocateVirtualMemoryRemoteApiCall\", \"NtMapViewOfSectionRemoteApiCall\", \"NtProtectVirtualMemoryApiCall\", \"SetThreadContextRemoteApiCall\", \"QueueUserApcRemoteApiCall\")\n    | where FileName in~ (ADWSFileNames)\n    | where not(InitiatingProcessFolderPath startswith @\"c:\\program files\\vmware\\vmware tools\" and InitiatingProcessFileName =~ \"vmtoolsd.exe\")\n    | where not(InitiatingProcessFolderPath =~ @\"C:\\Windows\\System32\" and InitiatingProcessFileName =~ \"csrss.exe\")\n    | where not(InitiatingProcessFolderPath =~ @\"C:\\Windows\\System32\\csrss.exe\")\n    | where not(InitiatingProcessFolderPath startswith @\"c:\\program files\\microsoft azure ad sync\\\" and InitiatingProcessFileName =~ \"miiserver.exe\")\n    | where not (InitiatingProcessFileName =~ \"RssHookx64Z.exe\" and InitiatingProcessFolderPath contains @\"\\appdata\\local\\securelink\\slinksw\")\n    | extend FileName=tolower(FileName)\n    | lookup kind=inner ADWSConnections on DeviceId, $left.ProcessId == $right.InitiatingProcessId, $left.FileName == $right.InitiatingProcessFileName\n    | project DeviceId, ProcessId, FileName, InjectorProcessId=InitiatingProcessId, InjectorFileName=InitiatingProcessFileName, InjectorProcessFolderPath=InitiatingProcessFolderPath, InjectorActionType=ActionType\n);\n// Find ADWS connections from processes that were injected into by another process.\nADWSConnections\n| lookup kind=inner InjectorProcesses on DeviceId, $left.InitiatingProcessId == $right.ProcessId, $left.InitiatingProcessFileName == $right.FileName\n| extend InitiatingProcessDirectory = substring(InitiatingProcessFolderPath, 0, strlen(InitiatingProcessFolderPath) - strlen(InitiatingProcessFileName) - 1)\n| summarize arg_min(TimeGenerated,*), InjectionMethods=make_set(InjectorActionType) by DeviceName, DeviceId, InitiatingProcessFileName, InitiatingProcessDirectory, InitiatingProcessAccountUpn, InitiatingProcessId, InjectorFileName, InjectorProcessFolderPath\n| extend HostName= tostring(split(DeviceName, '.', 0)[0]), DnsDomain = tostring(strcat_array(array_slice(split(DeviceName, '.'), 1, -1), '.'))","queryFrequency":"PT20M","queryPeriod":"PT20M","triggerOperator":"GreaterThan","triggerThreshold":0,"suppressionDuration":"PT5H","suppressionEnabled":false,"tactics":["DefenseEvasion","Discovery","Collection"],"techniques":["T1087","T1119","T1055"],"subTechniques":null,"incidentConfiguration":{"createIncident":true,"groupingConfiguration":{"enabled":true,"reopenClosedIncident":false,"lookbackDuration":"P7D","matchingMethod":"AllEntities","groupByEntities":null,"groupByAlertDetails":null,"groupByCustomDetails":null}},"eventGroupingSettings":{"aggregationKind":"AlertPerResult"},"entityMappings":[{"entityType":"Host","fieldMappings":[{"identifier":"FullName","columnName":"DeviceName"},{"identifier":"HostName","columnName":"HostName"},{"identifier":"DnsDomain","columnName":"DnsDomain"}]},{"entityType":"Account","fieldMappings":[{"identifier":"FullName","columnName":"InitiatingProcessAccountUpn"}]},{"entityType":"File","fieldMappings":[{"identifier":"Name","columnName":"InjectorFileName"},{"identifier":"Directory","columnName":"InjectorProcessFolderPath"}]},{"entityType":"File","fieldMappings":[{"identifier":"Name","columnName":"InitiatingProcessFileName"},{"identifier":"Directory","columnName":"InitiatingProcessDirectory"}]},{"entityType":"Process","fieldMappings":[{"identifier":"CommandLine","columnName":"InitiatingProcessCommandLine"},{"identifier":"ProcessId","columnName":"InitiatingProcessId"}]},{"entityType":"Process","fieldMappings":[{"identifier":"CommandLine","columnName":"InjectorProcessFolderPath"},{"identifier":"ProcessId","columnName":"InjectorProcessId"}]}]}}]}