{"$schema":"https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#","contentVersion":"1.0.0.0","parameters":{"workspace":{"type":"String"}},"resources":[{"id":"[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/IN-INA-MDFE-02:_Webshells_spawned_by_WSUS_service')]","name":"[concat(parameters('workspace'),'/Microsoft.SecurityInsights/IN-INA-MDFE-02:_Webshells_spawned_by_WSUS_service')]","type":"Microsoft.OperationalInsights/workspaces/providers/alertRules","kind":"Scheduled","apiVersion":"2023-12-01-preview","properties":{"displayName":"IN-INA-MDFE-02:_Webshells_spawned_by_WSUS_service","description":"Adversaries may attempt to exploit a weakness in an Internet-facing host or system to initially access a network. The weakness in the system can be a software bug, a temporary glitch, or a misconfiguration. Exploited applications are often websites/web servers. This use case detects webshells spawned by Windows Server Update Services (WSUS).\n","severity":"High","enabled":true,"query":"DeviceProcessEvents\n| where (InitiatingProcessFileName =~ \"wsusservice.exe\"\nor (InitiatingProcessFileName =~ \"w3wp.exe\" and InitiatingProcessCommandLine contains \"wsuspool\")) \nand (FileName has_any (\"cmd.exe\",\"powershell.exe\",\"pwsh.exe\"))\n| summarize TimeGenerated = min(TimeGenerated), ProcessCommandLineSample = take_any(ProcessCommandLine), Command_Executed = make_set(pack(\n  \"FileName\",FileName,\n  \"ProcessCommandLine\", ProcessCommandLine,\n  \"InitiatingProcessFileName\", InitiatingProcessFileName,\n  \"InitiatingProcessCommandLine\", InitiatingProcessCommandLine,\n  \"ProcessId\", ProcessId,\n  \"InitiatingProcessId\",InitiatingProcessId,\n  \"ReportId\", ReportId\n)) by DeviceId, DeviceName, InitiatingProcessParentFileName, LogonId, AccountName, InitiatingProcessAccountName, FileName, InitiatingProcessFileName, InitiatingProcessCommandLine","queryFrequency":"PT10M","queryPeriod":"PT10M","triggerOperator":"GreaterThan","triggerThreshold":0,"suppressionDuration":"PT5H","suppressionEnabled":false,"tactics":["InitialAccess","Execution"],"techniques":["T1190","T1059"],"subTechniques":null,"incidentConfiguration":{"createIncident":true,"groupingConfiguration":{"enabled":true,"reopenClosedIncident":false,"lookbackDuration":"P7D","matchingMethod":"AllEntities","groupByEntities":null,"groupByAlertDetails":null,"groupByCustomDetails":null}},"eventGroupingSettings":{"aggregationKind":"AlertPerResult"},"entityMappings":[{"entityType":"Host","fieldMappings":[{"identifier":"FullName","columnName":"DeviceName"}]},{"entityType":"Account","fieldMappings":[{"identifier":"FullName","columnName":"AccountName"}]},{"entityType":"Process","fieldMappings":[{"identifier":"CommandLine","columnName":"ProcessCommandLineSample"}]},{"entityType":"Process","fieldMappings":[{"identifier":"CommandLine","columnName":"InitiatingProcessCommandLine"}]},{"entityType":"File","fieldMappings":[{"identifier":"Name","columnName":"FileName"}]},{"entityType":"File","fieldMappings":[{"identifier":"Name","columnName":"InitiatingProcessFileName"}]}]}}]}