{"$schema":"https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#","contentVersion":"1.0.0.0","parameters":{"workspace":{"type":"String"}},"resources":[{"id":"[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/EX-EVA-MDFE-03:_Outbound_Network_Connection_via_Compiled_HTML_File')]","name":"[concat(parameters('workspace'),'/Microsoft.SecurityInsights/EX-EVA-MDFE-03:_Outbound_Network_Connection_via_Compiled_HTML_File')]","type":"Microsoft.OperationalInsights/workspaces/providers/alertRules","kind":"Scheduled","apiVersion":"2023-12-01-preview","properties":{"displayName":"EX-EVA-MDFE-03:_Outbound_Network_Connection_via_Compiled_HTML_File","description":"Compiled HTML files (.chm) are commonly distributed as part of the Microsoft HTML Help system. Adversaries may conceal malicious code in a CHM file and deliver it to a victim for execution. CHM content is loaded by the HTML Help executable program (hh.exe). This rule identifies outbound network connections associated with CHM file execution via hh.exe (HTML Help executable). It correlates process and network events to detect cases where hh.exe launches or is involved in executing a process that references a .chm file and then initiates a connection to a public (non-private) IP address. This behavior may indicate the download of malicious payloads or command-and-control (C2) activity via CHM file abuse.\n","severity":"Medium","enabled":true,"query":"let suspicious_paths = dynamic([\"\\\\Downloads\\\\\", \"\\\\Desktop\\\\\", \"\\\\AppData\\\\\", \"\\\\ProgramData\\\\\", \"\\\\Temp\\\\\"]);\nDeviceProcessEvents\n| where InitiatingProcessFileName =~ \"hh.exe\"\n| where InitiatingProcessCommandLine contains \".chm\" and InitiatingProcessCommandLine has_any (suspicious_paths)\n| extend StartTime = TimeGenerated\n| project StartTime, DeviceId, DeviceName, InitiatingProcessParentFileName, InitiatingProcessFileName, FileName, InitiatingProcessFolderPath, FolderPath, InitiatingProcessSHA1, SHA1, InitiatingProcessCommandLine, ProcessCommandLine, InitiatingProcessAccountUpn, ProcessId\n| join kind = inner (\n DeviceNetworkEvents\n| where RemoteIPType == \"Public\" and ipv4_is_private(RemoteIP) == false\n| extend EndTime = TimeGenerated\n| project EndTime, ActionType, InitiatingProcessFileName, InitiatingProcessFolderPath, InitiatingProcessCommandLine, InitiatingProcessId, DeviceName, DeviceId, RemoteIP, RemotePort, RemoteUrl\n) on $left.ProcessId == $right.InitiatingProcessId, DeviceId\n| where (EndTime - StartTime) between (0min .. 10min)\n| project StartTime, EndTime, DeviceName, InitiatingProcessParentFileName, InitiatingProcessFileName, InitiatingProcessFolderPath, FileName, FolderPath, InitiatingProcessSHA1, SHA1, InitiatingProcessCommandLine, ProcessCommandLine, ProcessId, InitiatingProcessId, InitiatingProcessAccountUpn, InitiatingProcessFileName1, InitiatingProcessFolderPath1, InitiatingProcessCommandLine1, ActionType, RemotePort, RemoteIP, RemoteUrl","queryFrequency":"PT10M","queryPeriod":"PT10M","triggerOperator":"GreaterThan","triggerThreshold":0,"suppressionDuration":"PT5H","suppressionEnabled":false,"tactics":["DefenseEvasion"],"techniques":["T1218"],"subTechniques":null,"incidentConfiguration":{"createIncident":true,"groupingConfiguration":{"enabled":true,"reopenClosedIncident":false,"lookbackDuration":"P7D","matchingMethod":"AllEntities","groupByEntities":null,"groupByAlertDetails":null,"groupByCustomDetails":null}},"eventGroupingSettings":{"aggregationKind":"AlertPerResult"},"entityMappings":[{"entityType":"Host","fieldMappings":[{"identifier":"FullName","columnName":"DeviceName"}]},{"entityType":"Account","fieldMappings":[{"identifier":"FullName","columnName":"InitiatingProcessAccountUpn"}]},{"entityType":"Process","fieldMappings":[{"identifier":"CommandLine","columnName":"InitiatingProcessCommandLine"}]},{"entityType":"Process","fieldMappings":[{"identifier":"CommandLine","columnName":"ProcessCommandLine"}]},{"entityType":"IP","fieldMappings":[{"identifier":"Address","columnName":"RemoteIP"}]},{"entityType":"URL","fieldMappings":[{"identifier":"Url","columnName":"RemoteUrl"}]}]}}]}