{"$schema":"https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#","contentVersion":"1.0.0.0","parameters":{"workspace":{"type":"String"}},"resources":[{"id":"[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/Files-with-double-extensions')]","name":"[concat(parameters('workspace'),'/Microsoft.SecurityInsights/Files-with-double-extensions')]","type":"Microsoft.OperationalInsights/workspaces/providers/alertRules","kind":"Scheduled","apiVersion":"2023-12-01-preview","properties":{"displayName":"Files-with-double-extensions","description":"Adversaries may abuse a double extension in the filename as a means of masquerading the true file type. A file name may include a secondary file type extension that may cause only the first extension to be displayed (ex: File.txt.exe may render in some views as just File.txt). However, the second extension is the true file type that determines how the file is opened and executed. This detection alerts on events with executable files with fairly common socially engineered double file extensions.","severity":"Medium","enabled":true,"query":"DeviceProcessEvents\n| where FileName endswith \".pdf.exe\"\n    or FileName endswith \".doc.exe\"\n    or FileName endswith \".docx.exe\"\n    or FileName endswith \".mp3.exe\"\n    or FileName endswith \".jpg.exe\"\n    or FileName endswith \".jpeg.exe\"\n    or FileName endswith \".html.exe\"\n| join kind = leftanti ( //  Excluding events where the activity triggered a Defender alert\n   SecurityAlert\n    | where ProviderName == \"MDATP\"\n    | where AlertSeverity != \"Informational\"\n    | where AlertName in (\"Malicious File\",\"Malicious file was observed\")\n    | summarize by CompromisedEntity\n  )on $left.DeviceName == $right.CompromisedEntity\n| extend AccountCustomEntity = AccountName,HostCustomEntity = DeviceName, FileCustomEntity = FileName, InitiatingProcessCustomEntity = InitiatingProcessCommandLine,  ProcessCustomEntity = ProcessCommandLine\n| summarize by AccountCustomEntity, HostCustomEntity, FileCustomEntity, InitiatingProcessCustomEntity, ProcessCustomEntity","queryFrequency":"PT20M","queryPeriod":"PT20M","triggerOperator":"GreaterThan","triggerThreshold":0,"suppressionDuration":"PT5H","suppressionEnabled":false,"tactics":["DefenseEvasion","InitialAccess"],"techniques":["T1036"],"subTechniques":null,"incidentConfiguration":{"createIncident":true,"groupingConfiguration":{"enabled":true,"reopenClosedIncident":false,"lookbackDuration":"P7D","matchingMethod":"AllEntities","groupByEntities":null,"groupByAlertDetails":null,"groupByCustomDetails":null}},"eventGroupingSettings":{"aggregationKind":"AlertPerResult"},"entityMappings":null}}]}