id: ""
name: Admin_promotion_after_Role_Management_Application_Permission_Grant
severity: High
fp_rate: ""
permission_required: ""
mitre:
    - tactics:
        - Persistence
        - PrivilegeEscalation
      techniques:
        - T1098
        - T1078
entity_mapping:
    - entity_type: Account
      field_mapping:
        - identifier: Name
          column_name: AppDisplayName
        - identifier: AadUserId
          column_name: AppServicePrincipalId
    - entity_type: Account
      field_mapping:
        - identifier: FullName
          column_name: TargetName
    - entity_type: Account
      field_mapping:
        - identifier: FullName
          column_name: PermissionGrant_InitiatingUserPrincipalName
        - identifier: Name
          column_name: PermissionGrant_AccountName
        - identifier: UPNSuffix
          column_name: PermissionGrant_AccountUPNSuffix
    - entity_type: Account
      field_mapping:
        - identifier: FullName
          column_name: RoleAssignment_InitiatingUserPrincipalName
        - identifier: Name
          column_name: RoleAssignment_AccountName
        - identifier: UPNSuffix
          column_name: RoleAssignment_AccountUPNSuffix
    - entity_type: IP
      field_mapping:
        - identifier: Address
          column_name: PermissionGrant_InitiatingIpAddress
data_sources: []
tags: []
os_family: []
description: This rule looks for a service principal being granted the Microsoft Graph RoleManagement.ReadWrite.Directory (application) permission before being used to add an Microsoft Entra ID object or user account to an Admin directory role (i.e. Global Administrators). This is a known attack path that is usually abused when a service principal already has the AppRoleAssignment.ReadWrite.All permission granted. This permission allows an app to manage permission grants for application permissions to any API. A service principal can promote itself or other service principals to admin roles (i.e. Global Administrators). This would be considered a privilege escalation technique.
technical_description: ""
considerations: ""
false_positives: ""
blindspots: ""
response_plan: ""
references: []
query: |-
    let query_frequency = 1h;
    let query_period = 2h;
    AuditLogs
    | where ingestion_time() > ago(query_period)
    | where Category =~ "ApplicationManagement" and LoggedByService =~ "Core Directory"
    | where OperationName =~ "Add app role assignment to service principal"
    | mv-expand TargetResource = TargetResources
    | mv-expand modifiedProperty = TargetResource["modifiedProperties"]
    | where tostring(modifiedProperty["displayName"]) == "AppRole.Value"
    | extend PermissionGrant = tostring(modifiedProperty["newValue"])
    | where PermissionGrant has "RoleManagement.ReadWrite.Directory"
    | mv-apply modifiedProperty = TargetResource["modifiedProperties"] on (
        summarize modifiedProperties = make_bag(
            bag_pack(tostring(modifiedProperty["displayName"]),
                bag_pack("oldValue", trim(@'[\"\s]+', tostring(modifiedProperty["oldValue"])),
                    "newValue", trim(@'[\"\s]+', tostring(modifiedProperty["newValue"])))), 100)
    )
    | project
        PermissionGrant_TimeGenerated = TimeGenerated,
        PermissionGrant_OperationName = OperationName,
        PermissionGrant_Result = Result,
        PermissionGrant,
        AppDisplayName = tostring(modifiedProperties["ServicePrincipal.DisplayName"]["newValue"]),
        AppServicePrincipalId = tostring(modifiedProperties["ServicePrincipal.ObjectID"]["newValue"]),
        PermissionGrant_InitiatedBy = InitiatedBy,
        PermissionGrant_TargetResources = TargetResources,
        PermissionGrant_AdditionalDetails = AdditionalDetails,
        PermissionGrant_CorrelationId = CorrelationId
    | join kind=inner (
        AuditLogs
        | where ingestion_time() > ago(query_frequency)
        | where Category =~ "RoleManagement" and LoggedByService =~ "Core Directory" and AADOperationType =~ "Assign"
        | where isnotempty(InitiatedBy["app"])
        | mv-expand TargetResource = TargetResources
        | mv-expand modifiedProperty = TargetResource["modifiedProperties"]
        | where tostring(modifiedProperty["displayName"]) in ("Role.DisplayName", "RoleDefinition.DisplayName")
        | extend RoleAssignment = tostring(modifiedProperty["newValue"])
        | where RoleAssignment contains "Admin"
        | project
            RoleAssignment_TimeGenerated = TimeGenerated,
            RoleAssignment_OperationName = OperationName,
            RoleAssignment_Result = Result,
            RoleAssignment,
            TargetType = tostring(TargetResources[0]["type"]),
            TargetName = iff(isnotempty(TargetResources[0]["displayName"]), tostring(TargetResources[0]["displayName"]), tolower(TargetResources[0]["userPrincipalName"])),
            TargetId = tostring(TargetResources[0]["id"]),
            RoleAssignment_InitiatedBy = InitiatedBy,
            RoleAssignment_TargetResources = TargetResources,
            RoleAssignment_AdditionalDetails = AdditionalDetails,
            RoleAssignment_CorrelationId = CorrelationId,
            AppServicePrincipalId = tostring(InitiatedBy["app"]["servicePrincipalId"])
        ) on AppServicePrincipalId
    | where PermissionGrant_TimeGenerated < RoleAssignment_TimeGenerated
    | project PermissionGrant_TimeGenerated, PermissionGrant_OperationName, PermissionGrant_Result, PermissionGrant, AppDisplayName, AppServicePrincipalId, PermissionGrant_InitiatedBy, PermissionGrant_TargetResources, PermissionGrant_AdditionalDetails, PermissionGrant_CorrelationId, RoleAssignment_TimeGenerated, RoleAssignment_OperationName, RoleAssignment_Result, RoleAssignment, TargetType, TargetName, TargetId, RoleAssignment_InitiatedBy, RoleAssignment_TargetResources, RoleAssignment_AdditionalDetails, RoleAssignment_CorrelationId
    | extend PermissionGrant_InitiatingUserPrincipalName = tostring(PermissionGrant_InitiatedBy.user.userPrincipalName)
    | extend PermissionGrant_InitiatingAadUserId = tostring(PermissionGrant_InitiatedBy.user.id)
    | extend PermissionGrant_InitiatingIpAddress = tostring(iff(isnotempty(PermissionGrant_InitiatedBy.user.ipAddress), PermissionGrant_InitiatedBy.user.ipAddress, PermissionGrant_InitiatedBy.app.ipAddress))  | extend RoleAssignment_InitiatingUserPrincipalName = tostring(RoleAssignment_InitiatedBy.user.userPrincipalName)
    | extend RoleAssignment_InitiatingAadUserId = tostring(RoleAssignment_InitiatedBy.user.id)
    | extend RoleAssignment_InitiatingIpAddress = tostring(iff(isnotempty(RoleAssignment_InitiatedBy.user.ipAddress), RoleAssignment_InitiatedBy.user.ipAddress, RoleAssignment_InitiatedBy.app.ipAddress))
    | extend PermissionGrant_AccountName = tostring(split(PermissionGrant_InitiatingUserPrincipalName, "@")[0]), PermissionGrant_AccountUPNSuffix = tostring(split(PermissionGrant_InitiatingUserPrincipalName, "@")[1]), RoleAssignment_AccountName = tostring(split(RoleAssignment_InitiatingUserPrincipalName, "@")[0]), RoleAssignment_AccountUPNSuffix = tostring(split(RoleAssignment_InitiatingUserPrincipalName, "@")[1])
query_frequency: PT1H
query_period: PT2H
